package BAEKJOON.시간복잡도;

import java.io.*;
/**
 * 문제 번호: 24262
 * 문제 이름: 알고리즘 수업 - 알고리즘의 수행 시간 1
 * 문제 링크: https://www.acmicpc.net/problem/24262
 * 풀이: 주어진 메서드는 배열의 중간 인덱스 i를 계산해 그 값을 반환하는 것
 *  배열 접근은 O(1), 즉 상수 시간이기 때문에 입력 크기 n에 상관없이 수행횟수는 1
 *  f(n) = 1 이므로 주어진 문제의 최고차항의 계수는 0
 */
class Q24262_시간복잡도 {
    public static void main(String[] args) throws IOException {
        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        System.out.print("1\n0");
        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    }
}